NordicSemiconductor/nRF5-SDK-for-Mesh/examples/common/src/app_light_lightness.c
/* Copyright (c) 2010 - 2020, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "app_light_lightness.h"

#include <stdlib.h>

#include "nrf_mesh_config_examples.h"
#include "utils.h"
#include "mesh_app_utils.h"
#include "log.h"
#include "nrf_assert.h"
#include "nrf_mesh_assert.h"
#include "app_timer.h"
#include "app_transition.h"
#include "mesh_config_entry.h"
#include "mesh_config.h"

#include "light_lightness_mc.h"
#include "light_lightness_setup_server.h"
#include "light_lightness_utils.h"
#include "model_common.h"
#include "list.h"
#include "bearer_event.h"

/** This sample implementation shows how the model behavior requirements
 * of Light Lightness Setup server can be implemented.
 */

static generic_ponoff_setup_server_callbacks_t m_ponoff_srv_cbs;
static generic_dtt_server_callbacks_t m_dtt_srv_cbs;
static list_node_t * mp_app_light_lightness_head;
static bearer_event_flag_t m_transition_abort_flag;

/* Forward declarations */
static void transition_parameters_set(app_light_lightness_setup_server_t * p_app,
                                      int32_t delta,
                                      const model_transition_t * p_in_transition,
                                      app_transition_type_t transition_type);

static void light_lightness_state_set_cb(const light_lightness_setup_server_t * p_self,
                                         const access_message_rx_meta_t * p_meta,
                                         const light_lightness_set_params_t * p_in,
                                         const model_transition_t * p_in_transition,
                                         light_lightness_status_params_t * p_out);

static void light_lightness_state_get_cb(const light_lightness_setup_server_t * p_self,
                                         const access_message_rx_meta_t * p_meta,
                                         light_lightness_status_params_t * p_out);

static void light_lightness_state_last_get_cb(const light_lightness_setup_server_t * p_self,
                                              const access_message_rx_meta_t * p_meta,
                                              light_lightness_last_status_params_t * p_out);

static void light_lightness_state_default_set_cb(const light_lightness_setup_server_t * p_self,
                                                 const access_message_rx_meta_t * p_meta,
                                                 const light_lightness_default_set_params_t * p_in,
                                                 light_lightness_default_status_params_t * p_out);

static void light_lightness_state_default_get_cb(const light_lightness_setup_server_t * p_self,
                                                 const access_message_rx_meta_t * p_meta,
                                                 light_lightness_default_status_params_t * p_out);

static void light_lightness_state_range_set_cb(const light_lightness_setup_server_t * p_self,
                                               const access_message_rx_meta_t * p_meta,
                                               const light_lightness_range_set_params_t * p_in,
                                               light_lightness_range_status_params_t * p_out);

static void light_lightness_state_range_get_cb(const light_lightness_setup_server_t * p_self,
                                               const access_message_rx_meta_t * p_meta,
                                               light_lightness_range_status_params_t * p_out);

static void light_lightness_state_move_set_cb(const light_lightness_setup_server_t * p_self,
                                              const access_message_rx_meta_t * p_meta,
                                              const light_lightness_move_set_params_t * p_in,
                                              const model_transition_t * p_in_transition,
                                              light_lightness_status_params_t * p_out);


static void light_lightness_state_delta_set_cb(const light_lightness_setup_server_t * p_self,
                                               const access_message_rx_meta_t * p_meta,
                                               const light_lightness_delta_set_params_t * p_in,
                                               const model_transition_t * p_in_transition,
                                               light_lightness_status_params_t * p_out);

/**** end of callback declarations ****/

