NordicSemiconductor/nRF5-SDK-for-Mesh/examples/common/src/app_light_lightness.c
static const light_lightness_setup_server_callbacks_t light_lightness_setup_srv_cbs =
{
    .light_lightness_cbs.set_cb         = light_lightness_state_set_cb,
    .light_lightness_cbs.get_cb         = light_lightness_state_get_cb,
    .light_lightness_cbs.last_get_cb    = light_lightness_state_last_get_cb,
    .light_lightness_cbs.default_set_cb = light_lightness_state_default_set_cb,
    .light_lightness_cbs.default_get_cb = light_lightness_state_default_get_cb,
    .light_lightness_cbs.range_set_cb   = light_lightness_state_range_set_cb,
    .light_lightness_cbs.range_get_cb   = light_lightness_state_range_get_cb,
    .light_lightness_cbs.move_set_cb    = light_lightness_state_move_set_cb,
    .light_lightness_cbs.delta_set_cb   = light_lightness_state_delta_set_cb
};

static void range_get(uint16_t state_handle, light_lightness_range_status_params_t * p_range)
{
    ERROR_CHECK(light_lightness_mc_range_min_state_get(state_handle, &p_range->range_min));
    ERROR_CHECK(light_lightness_mc_range_max_state_get(state_handle, &p_range->range_max));
    ERROR_CHECK(light_lightness_mc_range_status_state_get(state_handle, &p_range->status));
}

/***** Light Lightness model interface callbacks ****/

static void light_lightness_state_get_cb(const light_lightness_setup_server_t * p_self,
                                         const access_message_rx_meta_t * p_meta,
                                         light_lightness_status_params_t * p_out)
{
    app_light_lightness_setup_server_t * p_app;
    uint16_t present_lightness;
    light_lightness_range_status_params_t range;

    p_app = PARENT_BY_FIELD_GET(app_light_lightness_setup_server_t,
                                light_lightness_setup_server,
                                p_self);
    NRF_MESH_ASSERT(p_app && p_out);
    app_transition_params_t * p_params = app_transition_ongoing_get(&p_app->state.transition);

    /* Requirement: Provide the current value of the light_lightness state */
    p_app->app_light_lightness_get_cb(p_app, &present_lightness);
    p_out->present_lightness = present_lightness;

    /* Requirement: Report remaining time during processing of SET or DELTA SET,
     *              Report zero/unknown transition time during processing of MOVE. */
    if (p_params->transition_type == APP_TRANSITION_TYPE_MOVE_SET)
    {
        range_get(p_self->state.handle, &range);
        p_out->target_lightness = p_app->state.target_lightness == range.range_max ? UINT16_MAX : 0;
        p_out->remaining_time_ms = (p_params->transition_time_ms == 0 || p_params->required_delta == 0) ?
                                    0 : MODEL_TRANSITION_TIME_UNKNOWN;
    }
    else
    {
        p_out->target_lightness = p_app->state.target_lightness;
        p_out->remaining_time_ms = app_transition_remaining_time_get(&p_app->state.transition);
    }

    __LOG(LOG_SRC_APP, LOG_LEVEL_DBG1, "GET Lightness: pr: %d tgt: %d tt: %d\n",
          p_out->present_lightness, p_out->target_lightness, p_out->remaining_time_ms);
}

static void light_lightness_state_set_cb(const light_lightness_setup_server_t * p_self,
                                         const access_message_rx_meta_t * p_meta,
                                         const light_lightness_set_params_t * p_in,
                                         const model_transition_t * p_in_transition,
                                         light_lightness_status_params_t * p_out)
{
    app_light_lightness_setup_server_t * p_app;
    uint16_t present_lightness;
    uint32_t transition_time_ms;
    light_lightness_range_status_params_t range;

    p_app = PARENT_BY_FIELD_GET(app_light_lightness_setup_server_t,
                                light_lightness_setup_server,
                                p_self);
    NRF_MESH_ASSERT(p_app && p_in);
    app_transition_params_t * p_params = app_transition_requested_get(&p_app->state.transition);

    /* Notify anyone interested that we just got a command to set the lightness */
    if (p_app->app_add_notify.app_notify_set_cb != NULL)
    {
        p_app->app_add_notify.app_notify_set_cb(p_app->app_add_notify.p_app_notify_v, p_in->lightness);
    }

    p_app->app_light_lightness_get_cb(p_app, &present_lightness);

    /* If delta is too large, target value should get clipped to range limits */
    range_get(p_self->state.handle, &range);

    /* There is a special case for lightness value of `0`. If requested lightness is zero, and
     * present value is also zero, target should be zero */
    p_app->state.target_snapshot = p_in->lightness > range.range_max ? range.range_max :
                                   p_in->lightness < range.range_min && p_in->lightness != 0 ? range.range_min :
                                   p_in->lightness;
    p_app->state.init_present_snapshot = p_app->state.present_lightness;

    ERROR_CHECK(light_lightness_mc_actual_state_set(p_self->state.handle, p_app->state.target_snapshot));
    if (p_app->state.target_snapshot >= LIGHT_LIGHTNESS_LAST_MIN)
    {
        ERROR_CHECK(light_lightness_mc_last_state_set(p_self->state.handle, p_app->state.target_snapshot,
                                                      LIGHT_LIGHTNESS_MC_WRITE_DESTINATION_FLASH_ONLY));
    }

    if (!p_self->state.initialized || (present_lightness != p_in->lightness))
    {
        (void) transition_parameters_set(p_app,
                                         (int32_t)p_app->state.target_snapshot - (int32_t)present_lightness,
                                         p_in_transition,
                                         APP_TRANSITION_TYPE_SET);

        transition_time_ms = p_params->transition_time_ms;
        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO,
              "SET: target lightness: %d  delay: %d  tt: %d  req-delta: %d \n",
              p_app->state.target_snapshot,
              p_app->state.transition.delay_ms,
              p_params->transition_time_ms,
              p_params->required_delta);

        app_transition_trigger(&p_app->state.transition);
    }
    else
    {
        transition_time_ms = 0;
    }

