NordicSemiconductor/nRF5-SDK-for-Mesh/examples/common/src/app_light_lightness.c
    /* Prepare response */
    if (p_out != NULL)
    {
        p_out->present_lightness = p_app->state.present_lightness;
        p_out->target_lightness  = p_app->state.target_snapshot;
        p_out->remaining_time_ms = transition_time_ms;
    }
}

static void light_lightness_state_delta_set_cb(const light_lightness_setup_server_t * p_self,
                                               const access_message_rx_meta_t * p_meta,
                                               const light_lightness_delta_set_params_t * p_in,
                                               const model_transition_t * p_in_transition,
                                               light_lightness_status_params_t * p_out)
{
    app_light_lightness_setup_server_t * p_app;
    int32_t target_lightness;
    light_lightness_range_status_params_t range;

    p_app = PARENT_BY_FIELD_GET(app_light_lightness_setup_server_t,
                                light_lightness_setup_server,
                                p_self);
    NRF_MESH_ASSERT(p_app && p_in);
    app_transition_params_t * p_params = app_transition_requested_get(&p_app->state.transition);

    /* Notify anyone interested that we just got a command to set the lightness */
    if (p_app->app_add_notify.app_notify_set_cb != NULL)
    {
        p_app->app_add_notify.app_notify_set_cb(p_app->app_add_notify.p_app_notify_v, p_in->delta_lightness);
    }

    p_app->state.new_tid = model_transaction_is_new(&p_app->light_lightness_setup_server.light_lightness_srv.tid_tracker);
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "tid: %d %s\n", p_in->tid, p_app->state.new_tid ?
          "New TID" : "Same TID, cumulative delta set");

    p_app->app_light_lightness_get_cb(p_app, &p_app->state.present_lightness);

    /* If delta is too large, target value should get clipped to range limits */
    range_get(p_self->state.handle, &range);

    if (p_app->state.new_tid)
    {
        p_app->state.init_present_snapshot = p_app->state.present_lightness;
    }

    target_lightness = p_app->state.new_tid ?
                        (int32_t)p_app->state.present_lightness + p_in->delta_lightness :
                        (int32_t)p_app->state.init_present_snapshot + p_in->delta_lightness;

    /* There is a special case for target lightness values of less than or equal to `0`.
     * If calculated target is less than or equal to zero, target should be zero. */
    p_app->state.target_snapshot = target_lightness <= 0 ? 0 :
                                   target_lightness > range.range_max ? range.range_max :
                                   target_lightness < range.range_min ? range.range_min :
                                   target_lightness;

    (void) transition_parameters_set(p_app,
                                     p_in->delta_lightness,
                                     p_in_transition,
                                     APP_TRANSITION_TYPE_DELTA_SET);

    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO,
          "Delta SET: delta: %d  delay: %d  tt: %d target: %d\n",
          p_in->delta_lightness,
          p_app->state.transition.delay_ms,
          p_params->transition_time_ms,
          p_app->state.target_snapshot);

    app_transition_trigger(&p_app->state.transition);

    /* Prepare response */
    if (p_out != NULL)
    {
        p_out->present_lightness = p_app->state.present_lightness;
        p_out->target_lightness  = p_app->state.target_snapshot;
        p_out->remaining_time_ms = p_params->transition_time_ms;
    }
}

static void light_lightness_state_move_set_cb(const light_lightness_setup_server_t * p_self,
                                              const access_message_rx_meta_t * p_meta,
                                              const light_lightness_move_set_params_t * p_in,
                                              const model_transition_t * p_in_transition,
                                              light_lightness_status_params_t * p_out)
{
    app_light_lightness_setup_server_t * p_app;
    light_lightness_range_status_params_t range;

    p_app = PARENT_BY_FIELD_GET(app_light_lightness_setup_server_t,
                                light_lightness_setup_server,
                                p_self);
    NRF_MESH_ASSERT(p_app && p_in);
    app_transition_params_t * p_params = app_transition_requested_get(&p_app->state.transition);

    /* Notify anyone interested that we just got a command to set the lightness */
    if (p_app->app_add_notify.app_notify_set_cb != NULL)
    {
        p_app->app_add_notify.app_notify_set_cb(p_app->app_add_notify.p_app_notify_v, p_in->delta);
    }

    transition_parameters_set(p_app, (int32_t)p_in->delta, p_in_transition,
                              APP_TRANSITION_TYPE_MOVE_SET);

    /* Requirement: For the status message: The target Generic Lightness state is the upper limit of
       the Generic Lightness state when the transition speed is positive, or the lower limit of the
       Generic Lightness state when the transition speed is negative. */
    p_app->app_light_lightness_get_cb(p_app, &p_app->state.present_lightness);
    range_get(p_self->state.handle, &range);

    if (p_in->delta > 0 &&
        p_app->state.transition.requested_params.transition_time_ms > 0)
    {
        p_app->state.target_snapshot = range.range_max;
    }
    else if (p_in->delta < 0 &&
             p_app->state.transition.requested_params.transition_time_ms > 0)
    {
        p_app->state.target_snapshot = range.range_min;
    }
    else
    {
        p_app->state.target_snapshot = p_app->state.present_lightness;
    }

    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO,
          "MOVE SET: move-lightness: %d  delay: %d  tt: %d \n",
          p_in->delta,
          p_app->state.transition.delay_ms,
          p_params->transition_time_ms);

    app_transition_trigger(&p_app->state.transition);

    /* Prepare response */
    if (p_out != NULL)
    {
        p_out->present_lightness = p_app->state.present_lightness;
        /* Insert values as expected in level status message for Move Set */
        p_out->target_lightness = p_app->state.target_lightness == range.range_max ? UINT16_MAX : 0;
        /* Response to Move Set message is sent with unknown transition time value, if
        given transition time is non-zero. */
        p_out->remaining_time_ms = (p_params->transition_time_ms == 0 || p_in->delta == 0) ?
                                    0 : MODEL_TRANSITION_TIME_UNKNOWN;
    }
}

/* Callback for updating the OnPowerUp state */
static void app_onpowerup_server_set_cb(const generic_ponoff_setup_server_t * p_self,
                                        const access_message_rx_meta_t * p_meta,
                                        const generic_ponoff_set_params_t * p_in,
                                        generic_ponoff_status_params_t * p_out)
{
    light_lightness_setup_server_t * p_s_server;

    NRF_MESH_ASSERT(p_self && p_in);


    p_s_server = PARENT_BY_FIELD_GET(light_lightness_setup_server_t,
                                     generic_ponoff_setup_srv,
                                     p_self);

    ERROR_CHECK(light_lightness_mc_onpowerup_state_set(p_s_server->state.handle, p_in->on_powerup));

