NordicSemiconductor/nRF5-SDK-for-Mesh/examples/common/src/app_light_lightness.c
    if (p_out)
    {
        p_out->on_powerup = p_in->on_powerup;
    }
}

static void app_onpowerup_server_get_cb(const generic_ponoff_setup_server_t * p_self,
                                        const access_message_rx_meta_t * p_meta,
                                        generic_ponoff_status_params_t * p_out)
{
    light_lightness_setup_server_t * p_s_server;

    NRF_MESH_ASSERT(p_self && p_out);

    p_s_server = PARENT_BY_FIELD_GET(light_lightness_setup_server_t,
                                     generic_ponoff_setup_srv,
                                     p_self);
    /* get the value of the state back from the flash */
    ERROR_CHECK(light_lightness_mc_onpowerup_state_get(p_s_server->state.handle, &p_out->on_powerup));
}

/* Callback for reading the DTT state */
void app_dtt_server_get_cb(const generic_dtt_server_t * p_self,
                           const access_message_rx_meta_t * p_meta,
                           generic_dtt_status_params_t * p_out)
{
    generic_ponoff_setup_server_t * p_ponoff_s_server;
    light_lightness_setup_server_t * p_s_server;

    NRF_MESH_ASSERT(p_self && p_out);

    p_ponoff_s_server =
        PARENT_BY_FIELD_GET(generic_ponoff_setup_server_t,
                            generic_dtt_srv,
                            p_self);

    p_s_server =
        PARENT_BY_FIELD_GET(light_lightness_setup_server_t,
                            generic_ponoff_setup_srv,
                            p_ponoff_s_server);

    /* get the value of the state back from the flash */
    ERROR_CHECK(light_lightness_mc_dtt_state_get(p_s_server->state.handle, &p_out->transition_time_ms));
}


/* Callback for updating the dtt state */
void app_dtt_server_set_cb(const generic_dtt_server_t * p_self,
                           const access_message_rx_meta_t * p_meta,
                           const generic_dtt_set_params_t * p_in,
                           generic_dtt_status_params_t * p_out)
{
    generic_dtt_status_params_t status_params;
    generic_ponoff_setup_server_t * p_ponoff_s_server;
    light_lightness_setup_server_t * p_s_server;

    NRF_MESH_ASSERT(p_self && p_in);

    p_ponoff_s_server = PARENT_BY_FIELD_GET(generic_ponoff_setup_server_t,
                                            generic_dtt_srv,
                                            p_self);

    p_s_server = PARENT_BY_FIELD_GET(light_lightness_setup_server_t,
                                     generic_ponoff_setup_srv,
                                     p_ponoff_s_server);

    ERROR_CHECK(light_lightness_mc_dtt_state_set(p_s_server->state.handle, p_in->transition_time_ms));
    status_params.transition_time_ms = p_in->transition_time_ms;

    /* Ignore status, as publish may fail due to several reasons and it is ok. */
    (void) generic_dtt_server_status_publish((generic_dtt_server_t *)p_self,
                                             (const generic_dtt_status_params_t *)&status_params);

    if (p_out)
    {
        p_out->transition_time_ms = p_in->transition_time_ms;
    }
}

static void light_lightness_state_last_get_cb(const light_lightness_setup_server_t * p_self,
                                              const access_message_rx_meta_t * p_meta,
                                              light_lightness_last_status_params_t * p_out)
{
    NRF_MESH_ASSERT(p_out);

    /* Requirement: Provide the current value of the light_lightness last state */
    /* Last is stored state. No callback to the app is required.*/
    ERROR_CHECK(light_lightness_mc_last_state_get(p_self->state.handle, &p_out->lightness));
}

static void light_lightness_state_default_get_cb(const light_lightness_setup_server_t * p_self,
                                                 const access_message_rx_meta_t * p_meta,
                                                 light_lightness_default_status_params_t * p_out)
{
    NRF_MESH_ASSERT(p_out);

    /* Requirement: Provide the current value of the light_lightness default state */
    /* default is stored state. No callback to the top app is required.*/
    ERROR_CHECK(light_lightness_mc_default_state_get(p_self->state.handle, &p_out->lightness));
}

static void publish_default(const light_lightness_setup_server_t *p_setup_server,
                            uint16_t value)
{
    light_lightness_default_status_params_t default_status_params = {0};

    NRF_MESH_ASSERT(p_setup_server);

    default_status_params.lightness = value;

    /* Ignore status, as publish may fail due to several reasons and it is ok. */
    (void) light_lightness_server_default_status_publish(&p_setup_server->light_lightness_srv,
                                                         &default_status_params);
}

static void light_lightness_state_default_set_cb(const light_lightness_setup_server_t * p_self,
                                                 const access_message_rx_meta_t * p_meta,
                                                 const light_lightness_default_set_params_t * p_in,
                                                 light_lightness_default_status_params_t * p_out)
{
    NRF_MESH_ASSERT(p_in);

    /* Update internal representation of default value. */
    ERROR_CHECK(light_lightness_mc_default_state_set(p_self->state.handle, p_in->lightness));
    publish_default(p_self, p_in->lightness);

    if (p_out)
    {
        /* Prepare response */
        p_out->lightness = p_in->lightness;
    }
}

static void light_lightness_state_range_get_cb(const light_lightness_setup_server_t * p_self,
                                               const access_message_rx_meta_t * p_meta,
                                               light_lightness_range_status_params_t * p_out)
{
    NRF_MESH_ASSERT(p_out);

    light_lightness_range_status_params_t range;
    range_get(p_self->state.handle, &range);
    p_out->range_min = range.range_min;
    p_out->range_max = range.range_max;
    p_out->status = range.status;
}

static void publish_range(const light_lightness_setup_server_t * p_setup_server,
                          light_lightness_range_status_params_t * p_value)
{
    NRF_MESH_ASSERT(p_setup_server);

