NordicSemiconductor/nRF5-SDK-for-Mesh/examples/common/src/app_light_lightness.c
    /* Ignore status, as publish may fail due to several reasons and it is ok. */
    (void) light_lightness_server_range_status_publish(&p_setup_server->light_lightness_srv,
                                                       (const light_lightness_range_status_params_t *)p_value);
}

static void light_lightness_state_range_set_cb(const light_lightness_setup_server_t * p_self,
                                               const access_message_rx_meta_t * p_meta,
                                               const light_lightness_range_set_params_t * p_in,
                                               light_lightness_range_status_params_t * p_out)
{
    light_lightness_range_status_params_t value;

    NRF_MESH_ASSERT(p_in);

    range_get(p_self->state.handle, &value);

    value.status = LIGHT_LIGHTNESS_RANGE_STATUS_SUCCESS;
    /* value.min and value.max give
     * the Light Lightness Range state of the Light Lightness Server */

    /* Determine if the message requires a Range state update. */
    if (p_in->range_min < LIGHT_LIGHTNESS_DEFAULT_RANGE_MIN)
    {
        value.status = LIGHT_LIGHTNESS_RANGE_STATUS_CANNOT_SET_RANGE_MIN;
        /* The message does not require a Range state update */
    }
    else if (p_in->range_max > LIGHT_LIGHTNESS_DEFAULT_RANGE_MAX)
    {
        value.status = LIGHT_LIGHTNESS_RANGE_STATUS_CANNOT_SET_RANGE_MAX;
        /* The message does not require a Range state update */
    }
    else
    {
        /* The range values are valid.
            * The message requires a Range state update. */
        value.range_min = p_in->range_min;
        value.range_max = p_in->range_max;
        ERROR_CHECK(light_lightness_mc_range_min_state_set(p_self->state.handle, value.range_min));
        ERROR_CHECK(light_lightness_mc_range_max_state_set(p_self->state.handle, value.range_max));
        ERROR_CHECK(light_lightness_mc_range_status_state_set(p_self->state.handle, value.status));

        publish_range(p_self, &value);
    }

    if (p_out)
    {
        /* Prepare for a response.
         */
        p_out->range_min = value.range_min;
        p_out->range_max = value.range_max;
        p_out->status = value.status;
    }
}

/***/
static uint32_t app_light_lightness_setup_server_init(light_lightness_setup_server_t * p_setup_server,
                                                      uint8_t element_index)
{
    uint32_t status;

    if (!p_setup_server)
    {
        return NRF_ERROR_NULL;
    }

    /* Initialize the Light Lightnes Setup server callback structure.
     */
    p_setup_server->settings.p_callbacks = &light_lightness_setup_srv_cbs;

    /* The setup server will initialize a generic PonOff instance.
    *  Initialize the PonOff callback structure.
    */
    m_ponoff_srv_cbs.ponoff_cbs.set_cb = app_onpowerup_server_set_cb;
    m_ponoff_srv_cbs.ponoff_cbs.get_cb = app_onpowerup_server_get_cb;
    p_setup_server->generic_ponoff_setup_srv.settings.p_callbacks = &m_ponoff_srv_cbs;

    /* The generic PonOff instance will initialize a DTT instance.
     * Initialize the DTT callback structure.
     */
    m_dtt_srv_cbs.dtt_cbs.set_cb = app_dtt_server_set_cb;
    m_dtt_srv_cbs.dtt_cbs.get_cb = app_dtt_server_get_cb;
    p_setup_server->generic_ponoff_setup_srv.generic_dtt_srv.settings.p_callbacks = &m_dtt_srv_cbs;

    /* Set the default state.
     */
    status = light_lightness_mc_open(&p_setup_server->state.handle);
    if (status != NRF_SUCCESS)
    {
        return status;
    }
    p_setup_server->state.initialized = false;

    return light_lightness_setup_server_init(p_setup_server, element_index);
}

static uint32_t publish_lightness(app_light_lightness_setup_server_t * p_app, uint32_t remaining_time_ms)
{
    light_lightness_status_params_t publication_data;
    light_lightness_server_t * p_light_lightness_srv;

    publication_data.present_lightness = p_app->state.present_lightness;
    publication_data.target_lightness  = p_app->state.target_lightness;
    publication_data.remaining_time_ms = remaining_time_ms;

    /* Notify anyone interested that we are publishing lightness */
    if (p_app->app_add_notify.app_add_publish_cb != NULL)
    {
        p_app->app_add_notify.app_add_publish_cb(p_app->app_add_notify.p_app_publish_v, &publication_data);
    }

    p_light_lightness_srv = &p_app->light_lightness_setup_server.light_lightness_srv;
    return light_lightness_server_status_publish((const light_lightness_server_t * )p_light_lightness_srv,
                                                 (const light_lightness_status_params_t *)&publication_data);
}


/***** Transition module callback function implementation *****/
/* Note: The task of the transition module is to implement gradual changes of `present_lightness` value
 * for all possible time intervals and step size combinations allowed by the lightness model, and the
 * callbacks from this module are used to implement actual lightness value changes.
 *
 * If you need to implement transitions using external hardware or other mechanisms you can use
 * individual callbacks to initiate specific actions on external hardware.
 */

static bool m_transition_abort_flag_cb(void)
{
    LIST_FOREACH(p_iter, mp_app_light_lightness_head)
    {
        app_light_lightness_setup_server_t * p_app = PARENT_BY_FIELD_GET(app_light_lightness_setup_server_t,
                                                                         node,
                                                                         p_iter);
        if (p_app->abort_move)
        {
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Move stopped\n");
            p_app->abort_move = false;
            app_transition_abort(&p_app->state.transition);
        }
    }
    return true;
}

static inline app_light_lightness_setup_server_t * transition_to_app(const app_transition_t * p_transition)
{
    app_light_lightness_state_t   * p_state;

    p_state = PARENT_BY_FIELD_GET(app_light_lightness_state_t,
                                  transition,
                                  p_transition);

    return PARENT_BY_FIELD_GET(app_light_lightness_setup_server_t,
                               state,
                               p_state);
}

static void transition_delay_start_cb(const app_transition_t * p_transition)
{
#if NRF_MESH_LOG_ENABLE
    app_light_lightness_setup_server_t * p_app;

    p_app = transition_to_app(p_transition);

    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO,
          "Element %d: starting delay, present-lightness: %d\n",
          p_app->light_lightness_setup_server.settings.element_index,
          p_app->state.present_lightness);
#endif
}

static void transition_start_cb(const app_transition_t * p_transition)
{
    app_light_lightness_setup_server_t * p_app;

    p_app = transition_to_app(p_transition);
    app_transition_params_t * p_params = app_transition_ongoing_get(&p_app->state.transition);

    if((p_app->state.transition.requested_params.transition_type == APP_TRANSITION_TYPE_DELTA_SET &&
       p_app->state.new_tid) ||
       (p_app->state.transition.requested_params.transition_type == APP_TRANSITION_TYPE_SET) ||
       (p_app->state.transition.requested_params.transition_type == APP_TRANSITION_TYPE_MOVE_SET))
    {
       p_app->state.initial_present_lightness = p_app->state.init_present_snapshot;
    }
    p_app->state.target_lightness = p_app->state.target_snapshot;

    p_app->state.published_ms = 0;

    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO,
          "Element %d: starting transition: initial-l: %d delta: %d tt: %d\n",
          p_app->light_lightness_setup_server.settings.element_index,
          p_app->state.initial_present_lightness,
          p_params->required_delta,
          p_params->transition_time_ms);

    if (p_app->app_light_lightness_transition_cb != NULL)
    {
        p_app->app_light_lightness_transition_cb(p_app,
                    p_params->transition_time_ms,
                    p_app->state.target_lightness);
    }
}


/* 6.1.2.2.5 Binding with the Light Lightness Range state
 * Light Lightness Actual = Light Lightness Range Min
 *   for non-zero values of the Light Lightness Actual state that are less than
 *   the value of the Light Lightness Range Min state
 * Light Lightness Actual = Light Lightness Range Max
 *   for non-zero values of the Light Lightness Actual state that are greater than
 *   the value of the Light Lightness Range Max state
 */
static void present_lightness_set(app_light_lightness_setup_server_t * p_app)
{
    if (p_app->app_light_lightness_set_cb != NULL)
    {
        p_app->app_light_lightness_set_cb(p_app, p_app->state.present_lightness);
    }
}

static void present_lightness_set_with_range_clip(app_light_lightness_setup_server_t * p_app)
{
    light_lightness_range_status_params_t range;

    range_get(p_app->light_lightness_setup_server.state.handle, &range);
    p_app->state.present_lightness =
            light_lightness_utils_actual_to_range_restrict(p_app->state.present_lightness,
                                                           range.range_min, range.range_max);
    present_lightness_set(p_app);
}

static inline bool lightness_limit_check(uint16_t present_lightness,
                                         light_lightness_range_status_params_t * p_range,
                                         int32_t required_delta)
{
    /* Return true, if the present value is at the range limits */
    return ((required_delta > 0 && present_lightness == p_range->range_max) ||
            (required_delta < 0 && present_lightness == p_range->range_min));
}

