NordicSemiconductor/nRF5-SDK-for-Mesh/examples/common/src/app_light_lightness.c
static void transition_tick_cb(const app_transition_t * p_transition)
{
    int32_t present_lightness;
    uint32_t elapsed_ms;
    uint32_t remaining_ms;
    light_lightness_range_status_params_t range;
    app_light_lightness_setup_server_t * p_app;

    p_app = transition_to_app(p_transition);
    app_transition_params_t * p_params = app_transition_ongoing_get(&p_app->state.transition);
    elapsed_ms = app_transition_elapsed_time_get((app_transition_t *)p_transition);
    remaining_ms = app_transition_remaining_time_get((app_transition_t *)p_transition);

    /* Calculate new value using linear interpolation and provide to the application. */
    if (p_params->transition_type != APP_TRANSITION_TYPE_MOVE_SET)
    {
        int32_t delta = (p_app->state.target_lightness - p_app->state.initial_present_lightness);
        present_lightness = p_app->state.initial_present_lightness +
            (delta * (int64_t)elapsed_ms /
             (int32_t)p_params->transition_time_ms);
    }
    else
    {
        present_lightness = p_app->state.initial_present_lightness +
            (((int64_t)elapsed_ms * (int64_t)p_params->required_delta) /
             (int64_t)p_params->transition_time_ms);
    }

    range_get(p_app->light_lightness_setup_server.state.handle, &range);

    p_app->state.present_lightness = present_lightness == 0 ? 0 :
                                     MIN((int32_t)MAX(present_lightness, range.range_min), range.range_max);
    present_lightness_set(p_app);
    if (p_params->transition_type == APP_TRANSITION_TYPE_MOVE_SET &&
        lightness_limit_check(p_app->state.present_lightness, &range, p_params->required_delta))
    {
        /* Stop transition for lightness */
        p_app->abort_move = true;
        bearer_event_flag_set(m_transition_abort_flag);
    }

    /* While the transition has at least one half second remaining, */
    /* publish intermediate lightness at one second intervals. */
    if ((remaining_ms > 500) && (elapsed_ms - p_app->state.published_ms > 1000))
    {
        p_app->state.published_ms = elapsed_ms;
        /* Ignore status, as publish may fail due to several reasons and it is ok. */
        (void) publish_lightness(p_app, remaining_ms);
    }
}

static void transition_complete_cb(const app_transition_t * p_transition)
{
    app_light_lightness_setup_server_t * p_app;

    p_app = transition_to_app(p_transition);
    app_transition_params_t * p_params = app_transition_ongoing_get(&p_app->state.transition);

    /* This handles a case, when a new transition has a non-zero delay, but zero transition time.
     * This also handles a case, when such request is received in the middle of another transition.
     * In usual cases when transition time is non-zero, this assignment will have no effect since
     * this copying is already done at start of the transition. */
    p_app->state.target_lightness = p_app->state.target_snapshot;

    if (p_params->transition_type != APP_TRANSITION_TYPE_MOVE_SET)
    {
        p_app->state.present_lightness = p_app->state.target_lightness;
    }

    present_lightness_set_with_range_clip(p_app);

    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO,
      "Element %d: transition completed, present-L: %d\n",
      p_app->light_lightness_setup_server.settings.element_index,
      p_app->state.present_lightness);

    /* The transition is complete */
    if (p_app->app_light_lightness_transition_cb != NULL)
    {
        p_app->app_light_lightness_transition_cb(p_app,
                    p_params->transition_time_ms,
                    p_app->state.target_lightness);
    }

    if (p_app->state.present_lightness >= LIGHT_LIGHTNESS_LAST_MIN)
    {
        ERROR_CHECK(light_lightness_mc_last_state_set(p_app->light_lightness_setup_server.state.handle,
                                                      p_app->state.present_lightness,
                                                      LIGHT_LIGHTNESS_MC_WRITE_DESTINATION_ALL));
    }
    ERROR_CHECK(light_lightness_mc_actual_state_set(p_app->light_lightness_setup_server.state.handle,
                                                    p_app->state.present_lightness));

    /* Ignore status, as publish may fail due to several reasons and it is ok. */
    (void) publish_lightness(p_app, 0);
}

static void transition_parameters_set(app_light_lightness_setup_server_t * p_app,
                                      int32_t delta,
                                      const model_transition_t * p_in_transition,
                                      app_transition_type_t transition_type)
{
    app_transition_params_t * p_params = app_transition_requested_get(&p_app->state.transition);

    p_params->transition_type = transition_type;
    p_params->required_delta  = delta;
    p_params->minimum_step_ms = TRANSITION_STEP_MIN_MS;

    /* Requirement: If transition time parameters are unavailable and default transition time state
    is not available, transition shall be instantaneous. */
    if (p_in_transition == NULL)
    {
        p_app->state.transition.delay_ms = 0;

        ERROR_CHECK(light_lightness_mc_dtt_state_get(p_app->light_lightness_setup_server.state.handle,
                                                     &p_params->transition_time_ms));
    }
    else
    {
        p_app->state.transition.delay_ms = p_in_transition->delay_ms;
        p_params->transition_time_ms = p_in_transition->transition_time_ms;
    }
}


/***** Interface functions *****/

uint32_t app_light_lightness_model_init(app_light_lightness_setup_server_t * p_app, uint8_t element)
{
    uint32_t status = NRF_ERROR_NULL;
    if (p_app == NULL)
    {
        return status;
    }

    if ( (p_app->app_light_lightness_get_cb == NULL) ||
         ( (p_app->app_light_lightness_set_cb == NULL) &&
           (p_app->app_light_lightness_transition_cb == NULL) ) )
    {
        return NRF_ERROR_NULL;
    }

    /* Initialize a light lightness setup server.
     * This will also initialize all the models that the light lightness setup server extends.
     */
    status = app_light_lightness_setup_server_init(&p_app->light_lightness_setup_server, element);
    if (status != NRF_SUCCESS)
    {
        return status;
    }

