NordicSemiconductor/nRF5-SDK-for-Mesh/examples/common/src/app_light_lightness.c
    p_app->state.transition.delay_start_cb = transition_delay_start_cb;
    p_app->state.transition.transition_start_cb = transition_start_cb;
    p_app->state.transition.transition_tick_cb = transition_tick_cb;
    p_app->state.transition.transition_complete_cb = transition_complete_cb;
    p_app->state.transition.p_context = &p_app->state.transition;
    p_app->abort_move = false;

    status = app_transition_init(&p_app->state.transition);

    if (status == NRF_SUCCESS)
    {
        list_add(&mp_app_light_lightness_head, &p_app->node);
        m_transition_abort_flag = bearer_event_flag_add(m_transition_abort_flag_cb);
    }

    return status;
}

uint32_t app_light_lightness_binding_setup(app_light_lightness_setup_server_t * p_app)
{
    light_lightness_saved_values_t state;
    light_lightness_setup_server_t * p_s_server;
    uint16_t index;

    if (p_app == NULL)
    {
        return NRF_ERROR_NULL;
    }

    p_s_server = &p_app->light_lightness_setup_server;
    index    = p_s_server->state.handle;

    ERROR_CHECK(light_lightness_mc_range_status_state_get(index, &state.range.status));
    ERROR_CHECK(light_lightness_mc_range_min_state_get(index, &state.range.range_min));
    ERROR_CHECK(light_lightness_mc_range_max_state_get(index, &state.range.range_max));
    ERROR_CHECK(light_lightness_mc_onpowerup_state_get(index, &state.onpowerup));
    ERROR_CHECK(light_lightness_mc_actual_state_get(index, &state.actual_lightness));
    ERROR_CHECK(light_lightness_mc_last_state_get(index, &state.last_lightness));
    ERROR_CHECK(light_lightness_mc_default_state_get(index, &state.default_lightness));

    return light_lightness_ponoff_binding_setup(p_s_server, &state);
}

uint32_t app_light_lightness_current_value_publish(app_light_lightness_setup_server_t * p_app)
{
    if (p_app == NULL)
    {
        return NRF_ERROR_NULL;
    }

    app_transition_abort(&p_app->state.transition);
    p_app->app_light_lightness_get_cb(p_app, &p_app->state.present_lightness);

    if (p_app->state.present_lightness >= LIGHT_LIGHTNESS_LAST_MIN)
    {
        ERROR_CHECK(light_lightness_mc_last_state_set(p_app->light_lightness_setup_server.state.handle,
                                                      p_app->state.present_lightness,
                                                      LIGHT_LIGHTNESS_MC_WRITE_DESTINATION_ALL));
    }
    ERROR_CHECK(light_lightness_mc_actual_state_set(p_app->light_lightness_setup_server.state.handle,
                                                    p_app->state.present_lightness));

    /* Notify anyone interested that we just got a command to set the lightness */
    if (p_app->app_add_notify.app_notify_set_cb != NULL)
    {
        p_app->app_add_notify.app_notify_set_cb(p_app->app_add_notify.p_app_notify_v, p_app->state.present_lightness);
    }

    return publish_lightness(p_app, 0);
}

uint32_t app_light_lightness_direct_actual_set(app_light_lightness_setup_server_t * p_app, uint16_t lightness_value)
{
    if (p_app == NULL)
    {
        return NRF_ERROR_NULL;
    }

    p_app->state.present_lightness = lightness_value;

    present_lightness_set_with_range_clip(p_app);
    app_transition_params_t * p_params = app_transition_requested_get(&p_app->state.transition);

    /* The transition is complete */
    app_transition_abort(&p_app->state.transition);
    if (p_app->app_light_lightness_transition_cb != NULL)
    {
        p_app->app_light_lightness_transition_cb(p_app,
                    p_params->transition_time_ms,
                    lightness_value);
    }

    if (p_app->state.present_lightness >= LIGHT_LIGHTNESS_LAST_MIN)
    {
        ERROR_CHECK(light_lightness_mc_last_state_set(p_app->light_lightness_setup_server.state.handle,
                                                      p_app->state.present_lightness,
                                                      LIGHT_LIGHTNESS_MC_WRITE_DESTINATION_ALL));
    }
    ERROR_CHECK(light_lightness_mc_actual_state_set(p_app->light_lightness_setup_server.state.handle,
                                                    p_app->state.present_lightness));

    return NRF_SUCCESS;
}
